JBHarvey/design-iii/src/stm32/dev/src/main.c
	/* Initialize LED's. Make sure to check settings for your board in tm_stm32f4_disco.h file */
	TM_DISCO_LedInit();

	/* Initialize USB VCP */

	TM_USB_VCP_Init();

	initBtn();

// Initialisation des variables
	int mainState = MAIN_PID;
//setState(&mainState, MAIN_MOVE);

	int state = IDLE;

// initializations for manchester signal
	InitializeLEDs();
	InitializeManchesterInput();
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
	initializeExternalInterruptLine4();

	float consigneX;
	float consigneY;

	while (1) {

		// Vite fait debounce pour le bouton bleu
		if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)) {
			int i;
			for (i = 0; i < 9000000; i++)
				;
			TM_DISCO_LedOn (LED_BLUE);
			switch (mainState) {
			case MAIN_IDLE:
				mainState = MAIN_PID;
				//setState(&mainState, MAIN_MOVE);
				break;
			}
		}

		uint8_t command = readUSB();
		if (command != 0) {

			uint8_t sizeOfData = readUSB();

			processCommand(command, sizeOfData, &mainState);

			setState(&mainState, MAIN_PID);
		}

		/* Main state machine */
		switch (mainState) {
		case MAIN_IDLE:
			//if (consigne != 0)
			//setState(&mainState, consigne);
			break;
		case MAIN_ACQUIS:
			/* Action lors d'une acquisition */
			readUSB();
			state = command;

			if (state == GENERATE_FIRST_PWM) {
				generateFirstPWM();
				state = BETWEEN_PWM;
			} else if (state == ACQUIRE) {
				startFillingBuffer();
				state = WAIT_FOR_SECOND_PWM;
			} else if (state == SEND_DATA) {
				for (int i = 0; i < TAILLE; i++) {
					TM_USB_VCP_Putc(speedBuffer[i] & 0x00ff);
					TM_USB_VCP_Putc((speedBuffer[i] & 0xff00) >> 8);
				}
				state = IDLE;
			} else if (state == WAIT_FOR_SECOND_PWM && speedIndex > 200) {
				generateSecondPWM();
				state = IDLE;
			}
			break;
		case MAIN_MOVE:
			//Initialize Systick timer
			TM_DELAY_Init();
			TM_DISCO_LedOn (LED_BLUE);
			TM_DISCO_LedOn (LED_ORANGE);
			// Example of direction setting of 4 motors
			//MotorSetDirection(1, CLOCK);
			//MotorSetDirection(2, CLOCK);
			//MotorSetDirection(3, CLOCK);
			//MotorSetDirection(4, CLOCK);

			// Example of speed setting of 4 motors
			//MotorSetSpeed(1, 50);
			//MotorSetSpeed(2, 50);
			//MotorSetSpeed(3, 50);
			//MotorSetSpeed(4, 50);

			//Delayms(2000);

			//MotorSetSpeed(1, 0);
			//MotorSetSpeed(2, 0);
			//MotorSetSpeed(3, 0);
			//MotorSetSpeed(4, 0);

			//Delayms(2000);

			//move(100);

			MotorSetDirection(1, COUNTER_CLOCK);
			MotorSetDirection(2, BRAKE_G);
			MotorSetDirection(3, CLOCK);
			MotorSetDirection(4, BRAKE_G);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 0);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 0);

			Delayms(2000);

			MotorSetDirection(1, CLOCK);
			MotorSetDirection(2, BRAKE_G);
			MotorSetDirection(3, COUNTER_CLOCK);
			MotorSetDirection(4, BRAKE_G);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 0);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 0);

			Delayms(2000);

			MotorSetDirection(1, CLOCK);
			MotorSetDirection(2, CLOCK);
			MotorSetDirection(3, COUNTER_CLOCK);
			MotorSetDirection(4, COUNTER_CLOCK);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 75);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 75);

			Delayms(1000);

			MotorSetDirection(1, CLOCK);
			MotorSetDirection(2, COUNTER_CLOCK);
			MotorSetDirection(3, COUNTER_CLOCK);
			MotorSetDirection(4, CLOCK);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 75);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 75);

			Delayms(1000);

			MotorSetDirection(1, COUNTER_CLOCK);
			MotorSetDirection(2, COUNTER_CLOCK);
			MotorSetDirection(3, CLOCK);
			MotorSetDirection(4, CLOCK);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 75);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 75);

			Delayms(1000);

			MotorSetDirection(1, COUNTER_CLOCK);
			MotorSetDirection(2, CLOCK);
			MotorSetDirection(3, CLOCK);
			MotorSetDirection(4, COUNTER_CLOCK);

			MotorSetSpeed(1, 75);
			MotorSetSpeed(2, 75);
			MotorSetSpeed(3, 75);
			MotorSetSpeed(4, 75);

			Delayms(1000);

			MotorSetDirection(1, BRAKE_G);
			MotorSetDirection(2, BRAKE_G);
			MotorSetDirection(3, BRAKE_G);
			MotorSetDirection(4, BRAKE_G);

			MotorSetSpeed(1, 0);
			MotorSetSpeed(2, 0);
			MotorSetSpeed(3, 0);
			MotorSetSpeed(4, 0);

			mainState = MAIN_MANCH;

			break;
		case MAIN_PID:
			consigneX = 0.24;
			consigneY = 0.24;

			/* Initialization of wheel 1 PIDs */
			PID_init(&PID_SPEED1, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED1, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION1, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);
			PID_SetOutputLimits(&PID_POSITION1, MIN_POS_COMMAND,
					MAX_POS_COMMAND);

			/* Initialization of wheel 2 PIDs */
			PID_init(&PID_SPEED2, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED2, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION2, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);

			/* Initialization of wheel 3 PIDs */
			PID_init(&PID_SPEED3, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED3, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION3, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);

			/* Initialization of wheel 4 PIDs */
			PID_init(&PID_SPEED4, PID_SPEED_KP, PID_SPEED_KI, PID_SPEED_KD,
					PID_Direction_Direct);
			PID_SetOutputLimits(&PID_SPEED4, MIN_SPEED_COMMAND,
					MAX_SPEED_COMMAND);
			PID_init(&PID_POSITION4, PID_POSITION_KP, PID_POSITION_KI,
					PID_POSITION_KD, PID_Direction_Direct);

			PID_POSITION1.mySetpoint = 0.25;
			PID_POSITION2.mySetpoint = 0.25;
			PID_POSITION3.mySetpoint = 0.25;
			PID_POSITION4.mySetpoint = 0.25;

			while (1) {

				if (PID_Compute_Position(&PID_POSITION1)) {
					float positionOutput = PID_POSITION1.myOutput;
					PID_SPEED1.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED1)) {
						int cmdMotor1 = PID_SPEED1.myOutput;
						if (cmdMotor1 > 0) {
							speedDirection1 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(1, COUNTER_CLOCK);
							//MotorSetDirection(3, COUNTER_CLOCK);
						} else if (cmdMotor1 < 0) {

							speedDirection1 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(1, CLOCK);
							//MotorSetDirection(3, CLOCK);
							cmdMotor1 = -cmdMotor1;
						} else {
							speedDirection1 = SPEED_DIRECTION_NONE;
							//MotorSetDirection(1, BRAKE_G);
						}
						MotorSetSpeed(1, cmdMotor1);
						//MotorSetSpeed(3, cmdMotor1);

						PID_SetMode(&PID_SPEED1, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges1);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor1);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);

