JBHarvey/design-iii/src/stm32/dev/src/main.c
						/* send position to USB */
						/*TM_USB_VCP_Putc(2);
						 TM_USB_VCP_Putc(8);
						 VCP_DataTx((uint8_t*) &positionOutput, sizeof(float));
						 VCP_DataTx((uint8_t*) &positionOutput, sizeof(float));*/
					}

					PID_SPEED3.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED3)) {

						int cmdMotor3 = PID_SPEED3.myOutput;

						if (cmdMotor3 > 0) {
							speedDirection3 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(3, CLOCK);
							//MotorSetDirection(1, CLOCK);
						} else if (cmdMotor3 < 0) {

							speedDirection3 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(3, COUNTER_CLOCK);
							//MotorSetDirection(1, CLOCK);
							cmdMotor3 = -cmdMotor3;
						} else {
							speedDirection3 = SPEED_DIRECTION_NONE;
							MotorSetDirection(3, BRAKE_G);
							//MotorSetDirection(1, BRAKE_G);

						}

						MotorSetSpeed(3, cmdMotor3);
						PID_SetMode(&PID_SPEED3, PID_Mode_Manual);
					}
				}

				if (PID_Compute_Position(&PID_POSITION2)) {
					float positionOutput = PID_POSITION2.myOutput;
					PID_SPEED2.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED2)) {
						int cmdMotor2 = PID_SPEED2.myOutput;
						if (cmdMotor2 > 0) {
							speedDirection2 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(2, COUNTER_CLOCK);
							//MotorSetDirection(4, CLOCK);
						} else if (cmdMotor2 < 0) {
							speedDirection2 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(2, CLOCK);
							//MotorSetDirection(4, COUNTER_CLOCK);
							cmdMotor2 = -cmdMotor2;
						} else {
							speedDirection2 = SPEED_DIRECTION_NONE;
							MotorSetDirection(2, BRAKE_G);
							MotorSetDirection(4, BRAKE_G);

						}

						MotorSetSpeed(2, cmdMotor2);
						//MotorSetSpeed(4, cmdMotor2);
						PID_SetMode(&PID_SPEED2, PID_Mode_Manual);

						char numberString[MAX_DISPLAY_CHARACTERS];
						sprintf(numberString, "%d", numberOfSpeedEdges2);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(0, 0, numberString);
						sprintf(numberString, "%d", cmdMotor2);
						cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
						TM_HD44780_Puts(3, 0, numberString);
					}

					PID_SPEED4.mySetpoint = positionOutput;

					if (PID_Compute_Speed(&PID_SPEED4)) {
						int cmdMotor4 = PID_SPEED4.myOutput;

						if (cmdMotor4 > 0) {
							speedDirection4 = SPEED_DIRECTION_FORWARD;
							MotorSetDirection(4, CLOCK);
							//MotorSetDirection(2, COUNTER_CLOCK);
						} else if (cmdMotor4 < 0) {

							speedDirection4 = SPEED_DIRECTION_BACKWARD;
							MotorSetDirection(4, COUNTER_CLOCK);
							//MotorSetDirection(2, CLOCK);
							cmdMotor4 = -cmdMotor4;
						} else {
							speedDirection4 = SPEED_DIRECTION_NONE;
							MotorSetDirection(4, BRAKE_G);
							//MotorSetDirection(2, BRAKE_G);

						}

						MotorSetSpeed(4, cmdMotor4);
						PID_SetMode(&PID_SPEED4, PID_Mode_Manual);
					}
				}

				/*if (PID_Compute_Position(&PID_POSITION3)) {
				 float positionOutput = PID_POSITION3.myOutput;
				 PID_SPEED3.mySetpoint = positionOutput;

				 if (PID_Compute_Speed(&PID_SPEED3)) {
				 int cmdMotor3 = PID_SPEED3.myOutput;
				 if (cmdMotor3 > 0) {
				 speedDirection3 = SPEED_DIRECTION_FORWARD;
				 MotorSetDirection(3, COUNTER_CLOCK);
				 //MotorSetDirection(1, COUNTER_CLOCK);
				 } else if (cmdMotor3 < 0) {

				 speedDirection3 = SPEED_DIRECTION_BACKWARD;
				 MotorSetDirection(3, CLOCK);
				 //MotorSetDirection(1, CLOCK);
				 cmdMotor3 = -cmdMotor3;
				 } else {
				 speedDirection3 = SPEED_DIRECTION_NONE;
				 MotorSetDirection(3, BRAKE_G);
				 //MotorSetDirection(1, BRAKE_G);

				 }
				 MotorSetSpeed(3, cmdMotor3);
				 PID_SetMode(&PID_SPEED3, PID_Mode_Manual);

				 char numberString[MAX_DISPLAY_CHARACTERS];
				 sprintf(numberString, "%d", numberOfSpeedEdges3);
				 cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
				 TM_HD44780_Puts(0, 0, numberString);
				 sprintf(numberString, "%d", cmdMotor3);
				 cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
				 TM_HD44780_Puts(3, 0, numberString);
				 }
				 }*/
				/*if (PID_Compute_Position(&PID_POSITION4)) {
				 float positionOutput = PID_POSITION4.myOutput;
				 PID_SPEED4.mySetpoint = positionOutput;

				 if (PID_Compute_Speed(&PID_SPEED4)) {
				 int cmdMotor4 = PID_SPEED4.myOutput;
				 if (cmdMotor4 > 0) {
				 speedDirection4 = SPEED_DIRECTION_FORWARD;
				 MotorSetDirection(4, COUNTER_CLOCK);
				 //MotorSetDirection(2, COUNTER_CLOCK);
				 } else if (cmdMotor4 < 0) {

				 speedDirection4 = SPEED_DIRECTION_BACKWARD;
				 MotorSetDirection(4, CLOCK);
				 //MotorSetDirection(2, CLOCK);
				 cmdMotor4 = -cmdMotor4;
				 } else {
				 speedDirection4 = SPEED_DIRECTION_NONE;
				 MotorSetDirection(4, BRAKE_G);
				 //MotorSetDirection(2, BRAKE_G);

				 }
				 MotorSetSpeed(4, cmdMotor4);
				 PID_SetMode(&PID_SPEED4, PID_Mode_Manual);

				 char numberString[MAX_DISPLAY_CHARACTERS];
				 sprintf(numberString, "%d", numberOfSpeedEdges4);
				 cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
				 TM_HD44780_Puts(0, 0, numberString);
				 sprintf(numberString, "%d", cmdMotor4);
				 cleanNumberString(numberString, MAX_DISPLAY_CHARACTERS);
				 TM_HD44780_Puts(3, 0, numberString);
				 }

				 }*/
			}
			break;
		case MAIN_MANCH:
			tryToDecodeManchesterCode(&manchesterState, manchesterBuffer,
					&manchesterFigureVerification,
					manchesterOrientationVerification,
					&manchesterFactorVerification);
			break;
		default:
			setState(&mainState, MAIN_IDLE);
		}
	}
}

extern void EXTI4_IRQHandler(void) {
	if (EXTI_GetITStatus(EXTI_Line4) != RESET) {
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line4);
		manchesterState = MANCHESTER_FIRST;
		InitializeTimer5();
		EnableTimer5Interrupt();
		disableExternalInterruptLine4();
	}

}

extern void EXTI9_5_IRQHandler(void) {
	/* Make sure that interrupt flag is set */
	if (EXTI_GetITStatus(EXTI_Line5) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges1++;
		if (speedDirection1 == SPEED_DIRECTION_FORWARD) {
			numberOfPositionEdges1++;
		} else if (speedDirection1 == SPEED_DIRECTION_BACKWARD) {
			numberOfPositionEdges1--;
		}
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line5);
	}

	if (EXTI_GetITStatus(EXTI_Line6) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges1++;
		if (speedDirection1 == SPEED_DIRECTION_FORWARD) {
			numberOfPositionEdges1++;
		} else if (speedDirection1 == SPEED_DIRECTION_BACKWARD) {
			numberOfPositionEdges1--;
		}
		/* Clear interrupt flag */
		EXTI_ClearITPendingBit (EXTI_Line6);
	}

	if (EXTI_GetITStatus(EXTI_Line8) != RESET) {
		/* increase ticks */
		numberOfSpeedEdges2++;
		if (speedDirection2 == SPEED_DIRECTION_FORWARD) {
			numberOfPositionEdges2++;
		} else if (speedDirection2 == SPEED_DIRECTION_BACKWARD) {
			numberOfPositionEdges2--;

